app/controllers/aceptions_controller.rb

  def index
    @aceptions = Aception.all
---
SELECT "aceptions".* FROM "aceptions"

  def create
    @aception = Aception.new(aception_params)

    respond_to do |format|
      if @aception.save
---
INSERT INTO "aceptions" ("created_at", "description", "sequencial", "text", "updated_at", "word_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 29 Oct 2014 19:08:17 UTC +00:00], ["description", ""], ["sequencial", 1], ["text", "globo ocular"], ["updated_at", Wed, 29 Oct 2014 19:08:17 UTC +00:00], ["word_id", 1]]

    def set_aception
      @aception = Aception.find(params[:id])
---
SELECT "aceptions".* FROM "aceptions" WHERE "aceptions"."id" = ? LIMIT 1  [["id", "1"]]