app/controllers/dictionaries_controller.rb

  def index
    @dictionaries = Dictionary.all
---
SELECT "dictionaries".* FROM "dictionaries"

  def create
    @dictionary = Dictionary.new(dictionary_params)

    respond_to do |format|
      if @dictionary.save
---
INSERT INTO "dictionaries" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 29 Oct 2014 17:24:39 UTC +00:00], ["title", "Partes del cuerpo"], ["updated_at", Wed, 29 Oct 2014 17:24:39 UTC +00:00]]

  def update
    respond_to do |format|
      if @dictionary.update(dictionary_params)
---
UPDATE "dictionaries" SET "title" = ?, "updated_at" = ? WHERE "dictionaries"."id" = 2  [["title", "Jamelguería microtrópica"], ["updated_at", Wed, 29 Oct 2014 17:25:30 UTC +00:00]]

    def set_dictionary
      @dictionary = Dictionary.find(params[:id])
---
SELECT "dictionaries".* FROM "dictionaries" WHERE "dictionaries"."id" = ? LIMIT 1  [["id", "2"]]