app/controllers/words_controller.rb

SELECT "words".* FROM "words"
---
  def index
    @words = Word.all

INSERT INTO "words" ("created_at", "description", "language_id", "text", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 29 Oct 2014 19:06:22 UTC +00:00], ["description", ""], ["language_id", 1], ["text", "eye"], ["updated_at", Wed, 29 Oct 2014 19:06:22 UTC +00:00]]
---
  def create
    @word = Word.new(word_params)

    respond_to do |format|
      if @word.save

UPDATE "words" SET "text" = ?, "updated_at" = ? WHERE "words"."id" = 4  [["text", "tooth"], ["updated_at", Wed, 29 Oct 2014 17:12:14 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @word.update(word_params)

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT 1  [["id", "index"]]
---
    def set_word
      @word = Word.find(params[:id])